/* 
1. Напишите метод, которая возвращает массив из N элементов, заполненный нулями и единицами в случайном порядке.

N = 3 => [1, 0, 0]
N = 8 => [1,0,1,1,0,1,0,0]


2. написать метод, который принимает на вход
двоичное представление числа в виде массива ARR и выдаёт десятичное представление

ARR = [1, 0, 0] => 4
ARR = [1,0,1,1,0,1,0,0] => 180

3. написать метод, который принимает на вход
десятичное представление числа N и показатель основания СС P, в котороую
нужно перевести это число

N = 31, P = 2 => 11111
N = 31, P = 8 => 37

ДОГОВОРИМСЯ, что  2<= p <= 9
*/ 

